nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
// Handle the pedestrian timer: start blinky pedestrian green light
static void timer_handler_pedestrian (void *p_context)
{
    ret_code_t err_code;

    static int blink_cont = (int) BLINKY_STATE_DURATION / 0.25;                             // Number of cycles of turning on-turning off

    if (blink_cont > 0)
    {
        if (!(blink_cont%2))
        {
//            nrf_gpio_pin_clear(LED_GREEN_PEDESTRIAN);
            blink_cont--;
            err_code = app_timer_start ( timer_pedestrian, APP_TIMER_TICKS(250), NULL);
            APP_ERROR_CHECK(err_code);
        }
        else if (blink_cont%2)
        {
//            nrf_gpio_pin_set(LED_GREEN_PEDESTRIAN);
            blink_cont--;
            err_code = app_timer_start ( timer_pedestrian, APP_TIMER_TICKS(250), NULL);
            APP_ERROR_CHECK(err_code);
        }
    }
    else
    {
        blink_cont = (int) BLINKY_STATE_DURATION / 0.25;
    }
}


static void timers_start (void);

// Handle the frame_update time: the frame is updated periodically and the crypto signature calculated
static void timer_handler_frame_update (void *p_context)
{

}

// Timer initialization
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create	( &timer, APP_TIMER_MODE_SINGLE_SHOT, timer_handler );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create ( &timer_pedestrian, APP_TIMER_MODE_SINGLE_SHOT, timer_handler_pedestrian );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create ( &timer_frame_update, APP_TIMER_MODE_REPEATED, timer_handler_frame_update );
    APP_ERROR_CHECK(err_code);
}

// Start the execution of concatenated timers
static void timers_start (void)
{
    ret_code_t err_code;
    timer_handler (NULL);
    err_code = app_timer_start ( timer_frame_update, APP_TIMER_TICKS(BEACON_UPDATE_INTERVAL), NULL);
}

// Convert timer ticks to miliseconds
static uint32_t timer_ticks_to_ms (uint32_t ticks)
{
    return (ticks * 1000 * ((APP_TIMER_CONFIG_RTC_FREQUENCY) +1)) / APP_TIMER_CLOCK_FREQ;
}


// ======== Auxiliary functions ========

// Returns the duration of current traffic light state in seconds
static uint8_t current_state_duration ( )
{
    if (currentState == RED_STATE)
        return RED_STATE_DURATION;
    else if (currentState == YELLOW_STATE)
        return YELLOW_STATE_DURATION;
    else if (currentState == GREEN_STATE)
        return GREEN_STATE_DURATION;
    else
        return 0;
}


// ======== Board initialization ========

// Memory manager initialization
static void mem_init(void)
{
    ret_code_t err_code = nrf_mem_init();
    APP_ERROR_CHECK(err_code);
}

// Clock initialization
static void clock_init (void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);

    while(!nrf_drv_clock_lfclk_is_running())
    {
        /* Just waiting */
    }
}

// Power managemente initialization
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

// Function for handling the idle state (main loop)
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


int main(void)
{
    // Start initialization
    clock_init();
    timers_init();
    power_management_init();
    gpio_init();
    serial_init();
    ble_stack_init();
    advertising_init();
    radio_notification_init();
    mem_init();
    crypto_init();                                                                          // Crypto_init must be called AFTER ble_stack_init()!

    // Start execution.
    lastState = YELLOW_STATE;                                                               // Initial traffic light state
    frame_init();
    advertising_start();
    timers_start();

     // Enter main loop.
    for (;;)
    {
    	idle_state_handle();
    }
}
